In [71]:
%matplotlib inline
import numpy as np 
import pandas as pd 
import matplotlib.pyplot as lpt

In [2]:
df=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],columns=['A','B','C'],index=['x','y','z'])

In [3]:
df

   A  B  C
x  1  2  3
y  4  5  6
z  7  8  9

In [4]:
df.head()

   A  B  C
x  1  2  3
y  4  5  6
z  7  8  9

In [5]:
df.head(2)

   A  B  C
x  1  2  3
y  4  5  6

In [6]:
df.tail()

   A  B  C
x  1  2  3
y  4  5  6
z  7  8  9

In [7]:
df.tail(1)

   A  B  C
z  7  8  9

In [8]:
df.tail(1)

   A  B  C
z  7  8  9

In [9]:
df.describe()

         A    B    C
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, x to z
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes

In [11]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [12]:
df.keys()

Index(['A', 'B', 'C'], dtype='object')

In [13]:
df.nunique()
# nunique will give the number of unique values in the data frame with the columns

A    3
B    3
C    3
dtype: int64

In [14]:
df['A'].nunique()

3

In [15]:
df['A'].unique()

array([1, 4, 7])

In [16]:
df.shape

(3, 3)

In [17]:
df.size

9

In [18]:
df.describe()

         A    B    C
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

## Load the Data From the csv

In [19]:
coffee=pd.read_csv('/Users/chowdaryadithyasaividivada/Downloads/coffee.csv')

In [20]:
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [21]:
coffee.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Day          14 non-null     object
 1   Coffee Type  14 non-null     object
 2   Units Sold   14 non-null     int64
dtypes: int64(1), object(2)
memory usage: 468.0+ bytes

In [22]:
coffee.describe()

       Units Sold
count   14.000000
mean    32.857143
std      9.346798
min     15.000000
25%     26.250000
50%     35.000000
75%     38.750000
max     45.000000

In [23]:
results=pd.read_csv('/Users/chowdaryadithyasaividivada/Downloads/results.csv')

In [24]:
results

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,NaN,17.0,True,NaN
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,NaN
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,NaN,32.0,True,NaN
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,NaN
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,NaN
...,...,...,...,...,...,...,...,...,...,...,...
308403,2022.0,Winter,Luge,"Singles, Men (Olympic)",Marián Skupek,148983,SVK,NaN,26.0,False,NaN
308404,2022.0,Winter,Alpine Skiing (Skiing),"Slalom, Women (Olympic)",Elsa Fermbäck,148984,SWE,NaN,28.0,False,NaN
308405,2022.0,Winter,Alpine Skiing (Skiing),"Team, Mixed (Olympic)",Hilma Lövblom,148985,SWE,Sweden,13.0,False,NaN
308406,2022.0,Winter,Alpine Skiing (Skiing),"Giant Slalom, Women (Olympic)",Hilma Lövblom,148985,SWE,NaN,NaN,False,NaN
308407,2022.0,Winter,NaN,"Slalom, Women (Olympic)",Charlotta Säfvenberg,148986,NaN,NaN,24.0,False,NaN

In [25]:
results.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 308408 entries, 0 to 308407
Data columns (total 11 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   year        305807 non-null  float64
 1   type        305807 non-null  object
 2   discipline  308407 non-null  object
 3   event       308408 non-null  object
 4   as          308408 non-null  object
 5   athlete_id  308408 non-null  int64
 6   noc         308407 non-null  object
 7   team        121714 non-null  object
 8   place       283193 non-null  float64
 9   tied        308408 non-null  bool
 10  medal       44139 non-null   object
dtypes: bool(1), float64(2), int64(1), object(7)
memory usage: 23.8+ MB

In [26]:
bios=pd.read_csv('/Users/chowdaryadithyasaividivada/Downloads/bios.csv')

In [27]:
bios

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25
...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20

In [28]:
bios.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   athlete_id    145500 non-null  int64
 1   name          145500 non-null  object
 2   born_date     143693 non-null  object
 3   born_city     110908 non-null  object
 4   born_region   110908 non-null  object
 5   born_country  110908 non-null  object
 6   NOC           145499 non-null  object
 7   height_cm     106651 non-null  float64
 8   weight_kg     102070 non-null  float64
 9   died_date     33940 non-null   object
dtypes: float64(2), int64(1), object(7)
memory usage: 11.1+ MB

In [29]:
olympics=pd.read_excel('/Users/chowdaryadithyasaividivada/Downloads/olympics-data.xlsx')

In [30]:
olympics

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25
...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20

In [31]:
olympics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   athlete_id    145500 non-null  int64
 1   name          145500 non-null  object
 2   born_date     143693 non-null  object
 3   born_city     110908 non-null  object
 4   born_region   110908 non-null  object
 5   born_country  110908 non-null  object
 6   NOC           145499 non-null  object
 7   height_cm     106651 non-null  float64
 8   weight_kg     102070 non-null  float64
 9   died_date     33940 non-null   object
dtypes: float64(2), int64(1), object(7)
memory usage: 11.1+ MB

In [32]:
print(coffee)

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [33]:
print(olympics)

        athlete_id                   name   born_date        born_city  \
0                1  Jean-François Blanchy  1886-12-12         Bordeaux
1                2         Arnaud Boetsch  1969-04-01           Meulan
2                3           Jean Borotra  1898-08-13         Biarritz
3                4        Jacques Brugnon  1895-05-11      Paris VIIIe
4                5           Albert Canet  1878-04-17       Wandsworth
...            ...                    ...         ...              ...
145495      149222      Polina Luchnikova  2002-01-30            Serov
145496      149223    Valeriya Merkusheva  1999-09-20  Moskva (Moscow)
145497      149224        Yuliya Smirnova  1998-05-08           Kotlas
145498      149225         André Foussard  1899-05-19            Niort
145499      149814          Bill Phillips  1913-07-15     Dulwich Hill

                 born_region born_country        NOC  height_cm  weight_kg  \
0                    Gironde          FRA     France        NaN        NaN
1                   Yvelines          FRA     France      183.0       76.0
2       Pyrénées-Atlantiques          FRA     France      183.0       76.0
3                      Paris          FRA     France      168.0       64.0
4                    England          GBR     France        NaN        NaN
...                      ...          ...        ...        ...        ...
145495            Sverdlovsk          RUS        ROC      167.0       61.0
145496                Moskva          RUS        ROC      168.0       65.0
145497           Arkhangelsk          RUS        ROC      163.0       55.0
145498           Deux-Sèvres          FRA     France      166.0        NaN
145499       New South Wales          AUS  Australia        NaN        NaN

         died_date
0       1960-10-02
1              NaN
2       1994-07-17
3       1978-03-20
4       1930-07-25
...            ...
145495         NaN
145496         NaN
145497         NaN
145498  1986-03-18
145499  2003-10-20

[145500 rows x 10 columns]

In [34]:
olympics.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [35]:
olympics.head(2)

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN

In [36]:
olympics.tail(3)

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20

In [37]:
# to ge the random sample data

In [38]:
olympics.sample(10)

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
100300,101149,Andrei Lyskovets,1974-10-07,Minsk,Minsk,BLR,Belarus,174.0,60.0,NaN
10164,10220,Sayuri Maruyama,1975-12-22,NaN,NaN,NaN,Japan,162.0,56.0,NaN
5928,5954,Willy Dasso,1917-01-10,Lima,Lima,PER,Peru,NaN,NaN,1990-11-10
68560,69077,Chris Goudge,1935-03-04,Prestwich,England,GBR,Great Britain,183.0,71.0,2010-11-07
142337,145940,Agata Ozdoba-Błach,1988-02-25,NaN,NaN,NaN,Poland,NaN,NaN,NaN
137925,141307,Mahdi Habib,1989-03-15,NaN,NaN,NaN,Bahrain,NaN,NaN,NaN
101075,101943,Mariusz Musial,1978-01-01,Jelenia Góra,Dolnośląskie,POL,Norway,180.0,88.0,NaN
12939,13010,Hans Günter Winkler,1926-07-24,NaN,NaN,NaN,Germany West Germany,174.0,72.0,2018-07-09
16084,16196,Steve Poulter,1954-12-03,Ormskirk,England,GBR,Great Britain,NaN,NaN,NaN
103911,104908,Philaylack Sackpraseuth,1987-04-30,NaN,NaN,NaN,Lao People's Democratic Republic,160.0,53.0,NaN

In [39]:
olympics.loc[0]

athlete_id                          1
name            Jean-François Blanchy
born_date                  1886-12-12
born_city                    Bordeaux
born_region                   Gironde
born_country                      FRA
NOC                            France
height_cm                         NaN
weight_kg                         NaN
died_date                  1960-10-02
Name: 0, dtype: object

In [40]:
olympics.loc[0:5]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25
5,6,Nicolas Chatelain,1970-01-13,Amiens,Somme,FRA,France,181.0,70.0,NaN

In [41]:
olympics.loc[[1,4,3]]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20

In [42]:
coffee.loc[5:9,['Day','Units Sold']]

         Day  Units Sold
5  Wednesday          25
6   Thursday          40
7   Thursday          30
8     Friday          45
9     Friday          35

In [43]:
olympics.loc[olympics['born_country']=='FRA']

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
5,6,Nicolas Chatelain,1970-01-13,Amiens,Somme,FRA,France,181.0,70.0,NaN
...,...,...,...,...,...,...,...,...,...,...
144652,148348,James Clugnet,1996-12-04,Grenoble,Isère,FRA,Great Britain,NaN,NaN,NaN
145009,148720,Margaux Hackett,1999-06-02,Annecy,Haute-Savoie,FRA,New Zealand,NaN,NaN,NaN
145281,149002,Elliott Baralo,1998-08-01,Annecy,Haute-Savoie,FRA,Sweden,NaN,NaN,NaN
145467,149194,Elisa Nakab,1998-05-08,Briançon,Hautes-Alpes,FRA,Italy,NaN,NaN,NaN
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18

In [44]:
olympics.iloc[0:5,0:3]

   athlete_id                   name   born_date
0           1  Jean-François Blanchy  1886-12-12
1           2         Arnaud Boetsch  1969-04-01
2           3           Jean Borotra  1898-08-13
3           4        Jacques Brugnon  1895-05-11
4           5           Albert Canet  1878-04-17

In [45]:
olympics.index=olympics['athlete_id']

In [46]:
olympics.loc[:,['name','born_date']]

                             name   born_date
athlete_id
1           Jean-François Blanchy  1886-12-12
2                  Arnaud Boetsch  1969-04-01
3                    Jean Borotra  1898-08-13
4                 Jacques Brugnon  1895-05-11
5                    Albert Canet  1878-04-17
...                           ...         ...
149222          Polina Luchnikova  2002-01-30
149223        Valeriya Merkusheva  1999-09-20
149224            Yuliya Smirnova  1998-05-08
149225             André Foussard  1899-05-19
149814              Bill Phillips  1913-07-15

[145500 rows x 2 columns]

In [47]:
coffee.loc[1:3,['UnitsSold']]=10

In [48]:
coffee.head()

         Day Coffee Type  Units Sold  UnitsSold
0     Monday    Espresso          25        NaN
1     Monday       Latte          15       10.0
2    Tuesday    Espresso          30       10.0
3    Tuesday       Latte          20       10.0
4  Wednesday    Espresso          35        NaN

In [49]:
coffee.Day

0        Monday
1        Monday
2       Tuesday
3       Tuesday
4     Wednesday
5     Wednesday
6      Thursday
7      Thursday
8        Friday
9        Friday
10     Saturday
11     Saturday
12       Sunday
13       Sunday
Name: Day, dtype: object

## Sorting_values

In [50]:
coffee.sort_values(['Units Sold'])

          Day Coffee Type  Units Sold  UnitsSold
1      Monday       Latte          15       10.0
3     Tuesday       Latte          20       10.0
0      Monday    Espresso          25        NaN
5   Wednesday       Latte          25        NaN
2     Tuesday    Espresso          30       10.0
7    Thursday       Latte          30        NaN
4   Wednesday    Espresso          35        NaN
9      Friday       Latte          35        NaN
11   Saturday       Latte          35        NaN
13     Sunday       Latte          35        NaN
6    Thursday    Espresso          40        NaN
8      Friday    Espresso          45        NaN
10   Saturday    Espresso          45        NaN
12     Sunday    Espresso          45        NaN

In [51]:
coffee.sort_values(['Units Sold'],ascending=[0])

          Day Coffee Type  Units Sold  UnitsSold
8      Friday    Espresso          45        NaN
10   Saturday    Espresso          45        NaN
12     Sunday    Espresso          45        NaN
6    Thursday    Espresso          40        NaN
4   Wednesday    Espresso          35        NaN
9      Friday       Latte          35        NaN
11   Saturday       Latte          35        NaN
13     Sunday       Latte          35        NaN
2     Tuesday    Espresso          30       10.0
7    Thursday       Latte          30        NaN
0      Monday    Espresso          25        NaN
5   Wednesday       Latte          25        NaN
3     Tuesday       Latte          20       10.0
1      Monday       Latte          15       10.0

In [52]:
coffee.sort_values(['Units Sold','Coffee Type'],ascending=[0,1])

          Day Coffee Type  Units Sold  UnitsSold
8      Friday    Espresso          45        NaN
10   Saturday    Espresso          45        NaN
12     Sunday    Espresso          45        NaN
6    Thursday    Espresso          40        NaN
4   Wednesday    Espresso          35        NaN
9      Friday       Latte          35        NaN
11   Saturday       Latte          35        NaN
13     Sunday       Latte          35        NaN
2     Tuesday    Espresso          30       10.0
7    Thursday       Latte          30        NaN
0      Monday    Espresso          25        NaN
5   Wednesday       Latte          25        NaN
3     Tuesday       Latte          20       10.0
1      Monday       Latte          15       10.0

### Iterate over the dataframes with the loop

In [53]:
for index,row in coffee.iterrows():
    print(index)
    print(row)

0
Day              Monday
Coffee Type    Espresso
Units Sold           25
UnitsSold           NaN
Name: 0, dtype: object
1
Day            Monday
Coffee Type     Latte
Units Sold         15
UnitsSold        10.0
Name: 1, dtype: object
2
Day             Tuesday
Coffee Type    Espresso
Units Sold           30
UnitsSold          10.0
Name: 2, dtype: object
3
Day            Tuesday
Coffee Type      Latte
Units Sold          20
UnitsSold         10.0
Name: 3, dtype: object
4
Day            Wednesday
Coffee Type     Espresso
Units Sold            35
UnitsSold            NaN
Name: 4, dtype: object
5
Day            Wednesday
Coffee Type        Latte
Units Sold            25
UnitsSold            NaN
Name: 5, dtype: object
6
Day            Thursday
Coffee Type    Espresso
Units Sold           40
UnitsSold           NaN
Name: 6, dtype: object
7
Day            Thursday
Coffee Type       Latte
Units Sold           30
UnitsSold           NaN
Name: 7, dtype: object
8
Day              Friday
Coffee Type    Espresso
Units Sold           45
UnitsSold           NaN
Name: 8, dtype: object
9
Day            Friday
Coffee Type     Latte
Units Sold         35
UnitsSold         NaN
Name: 9, dtype: object
10
Day            Saturday
Coffee Type    Espresso
Units Sold           45
UnitsSold           NaN
Name: 10, dtype: object
11
Day            Saturday
Coffee Type       Latte
Units Sold           35
UnitsSold           NaN
Name: 11, dtype: object
12
Day              Sunday
Coffee Type    Espresso
Units Sold           45
UnitsSold           NaN
Name: 12, dtype: object
13
Day            Sunday
Coffee Type     Latte
Units Sold         35
UnitsSold         NaN
Name: 13, dtype: object

In [54]:
olympics.loc[1]

athlete_id                          1
name            Jean-François Blanchy
born_date                  1886-12-12
born_city                    Bordeaux
born_region                   Gironde
born_country                      FRA
NOC                            France
height_cm                         NaN
weight_kg                         NaN
died_date                  1960-10-02
Name: 1, dtype: object

In [55]:
for (index,row) in coffee.iterrows():
    print(row)

Day              Monday
Coffee Type    Espresso
Units Sold           25
UnitsSold           NaN
Name: 0, dtype: object
Day            Monday
Coffee Type     Latte
Units Sold         15
UnitsSold        10.0
Name: 1, dtype: object
Day             Tuesday
Coffee Type    Espresso
Units Sold           30
UnitsSold          10.0
Name: 2, dtype: object
Day            Tuesday
Coffee Type      Latte
Units Sold          20
UnitsSold         10.0
Name: 3, dtype: object
Day            Wednesday
Coffee Type     Espresso
Units Sold            35
UnitsSold            NaN
Name: 4, dtype: object
Day            Wednesday
Coffee Type        Latte
Units Sold            25
UnitsSold            NaN
Name: 5, dtype: object
Day            Thursday
Coffee Type    Espresso
Units Sold           40
UnitsSold           NaN
Name: 6, dtype: object
Day            Thursday
Coffee Type       Latte
Units Sold           30
UnitsSold           NaN
Name: 7, dtype: object
Day              Friday
Coffee Type    Espresso
Units Sold           45
UnitsSold           NaN
Name: 8, dtype: object
Day            Friday
Coffee Type     Latte
Units Sold         35
UnitsSold         NaN
Name: 9, dtype: object
Day            Saturday
Coffee Type    Espresso
Units Sold           45
UnitsSold           NaN
Name: 10, dtype: object
Day            Saturday
Coffee Type       Latte
Units Sold           35
UnitsSold           NaN
Name: 11, dtype: object
Day              Sunday
Coffee Type    Espresso
Units Sold           45
UnitsSold           NaN
Name: 12, dtype: object
Day            Sunday
Coffee Type     Latte
Units Sold         35
UnitsSold         NaN
Name: 13, dtype: object

In [56]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [57]:
bios.head(4)

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20

In [58]:
bios.loc[bios['height_cm']>215]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
5089,5108,Viktor Pankrashkin,1957-06-19,Moskva (Moscow),Moskva,RUS,Soviet Union,220.0,112.0,1993-07-24
5583,5606,Paulinho Villas Boas,1963-01-26,São Paulo,São Paulo,BRA,Brazil,217.0,106.0,NaN
5673,5696,Gunther Behnke,1963-01-19,Leverkusen,Nordrhein-Westfalen,GER,Germany,221.0,114.0,NaN
5716,5739,Uwe Blab,1962-03-26,München (Munich),Bayern,GER,Germany West Germany,218.0,110.0,NaN
5781,5804,Tommy Burleson,1952-02-24,Crossnore,North Carolina,USA,United States,223.0,102.0,NaN
5796,5819,Andy Campbell,1956-07-21,Melbourne,Victoria,AUS,Australia,218.0,93.0,NaN
6223,6250,Lars Hansen,1954-09-27,København (Copenhagen),Hovedstaden,DEN,Canada,216.0,105.0,NaN
6270,6298,Hu Zhangbao,1963-04-05,NaN,NaN,NaN,People's Republic of China,216.0,135.0,NaN
6409,6440,Sergey Kovalenko,1947-08-11,NaN,NaN,NaN,Soviet Union,216.0,111.0,2004-11-18
6420,6451,Jānis Krūmiņš,1930-01-30,Cēsis,Cēsu novads,LAT,Soviet Union,218.0,141.0,1994-11-20
6504,6537,Luc Longley,1969-01-19,Melbourne,Victoria,AUS,Australia,220.0,135.0,NaN
6722,6755,Shaquille O'Neal,1972-03-06,Newark,New Jersey,USA,United States,216.0,137.0,NaN
6937,6972,David Robinson,1965-08-06,Key West,Florida,USA,United States,216.0,107.0,NaN
6978,7013,Arvydas Sabonis,1964-12-19,Kaunas,Kaunas,LTU,Lithuania Soviet Union,223.0,122.0,NaN
7074,7111,Paulo da Silva,1963-07-21,São Paulo,São Paulo,BRA,Brazil,217.0,106.0,NaN
7188,7226,Vladimir Tkachenko,1957-09-20,Golovinka,Krasnodar Kray,RUS,Soviet Union,220.0,110.0,NaN
7281,7320,Stojko Vranković,1964-01-22,Drniš,Šibensko-kninska županija,CRO,Croatia Yugoslavia,217.0,115.0,NaN
7376,7416,Eurelijus Žukauskas,1973-08-22,Klaipėda,Klaipėda,LTU,Lithuania,218.0,115.0,NaN
52608,52983,Aleksey Kazakov,1976-03-18,Naberezhnye Chelny,Respublika Tatarstan,RUS,Russian Federation,217.0,102.0,NaN
82100,82753,Frédéric Weis,1977-06-22,Thionville,Moselle,FRA,France,218.0,110.0,NaN
89070,89782,Yao Ming,1980-09-12,Xuhui District,Shanghai,CHN,People's Republic of China,226.0,141.0,NaN
89075,89787,Roberto Dueñas,1975-11-01,Madrid,Madrid,ESP,Spain,221.0,137.0,NaN
107408,108533,Peter John Ramos,1985-05-23,Fajardo,Puerto Rico,PUR,Puerto Rico,219.0,113.0,NaN
112312,113568,Stanko Barać,1986-08-13,Mostar,Hercegovačko-neretvanski kanton,BIH,Croatia,217.0,110.0,NaN
112332,113588,Andreas Glyniadakis,1981-08-26,Chania,Kriti,GRE,Greece,216.0,115.0,NaN
112337,113593,Hamed Haddadi,1985-05-19,Ahvaz,Khuzestan,IRI,Islamic Republic of Iran,218.0,110.0,NaN
118663,120400,Timofey Mozgov,1986-07-16,NaN,NaN,NaN,Russian Federation,216.0,113.0,NaN
118676,120415,Dmitry Musersky,1988-10-29,Makiïvka,Donetsk,UKR,Russian Federation,219.0,104.0,NaN
120266,122147,Zhang Zhaoxu,1987-11-18,Binzhou,Shandong,CHN,People's Republic of China,221.0,110.0,NaN
121694,123709,Salah Mejri,1986-06-15,Jendouba,Jendouba,TUN,Tunisia,216.0,110.0,NaN
123850,126093,Tyson Chandler,1982-10-02,Hanford,California,USA,United States,216.0,107.0,NaN
130460,133147,Li Muhao,1992-06-02,Guiyang,Guizhou,CHN,People's Republic of China,218.0,115.0,NaN
130461,133148,Zhou Qi,1996-01-16,Xinxiang,Henan,CHN,People's Republic of China,217.0,95.0,NaN
138671,142084,Ondřej Balvín,1992-09-20,Ústí nad Labem,Ústecký kraj,CZE,Czechia,216.0,107.0,NaN
139365,142836,Moustapha Fall,1992-02-23,Paris,Paris,FRA,France,218.0,NaN,NaN

In [59]:
bios.loc[bios['height_cm']>215,['name',"height_cm"]]

                         name  height_cm
5089       Viktor Pankrashkin      220.0
5583     Paulinho Villas Boas      217.0
5673           Gunther Behnke      221.0
5716                 Uwe Blab      218.0
5781           Tommy Burleson      223.0
5796            Andy Campbell      218.0
6223              Lars Hansen      216.0
6270              Hu Zhangbao      216.0
6409         Sergey Kovalenko      216.0
6420            Jānis Krūmiņš      218.0
6504              Luc Longley      220.0
6722         Shaquille O'Neal      216.0
6937           David Robinson      216.0
6978          Arvydas Sabonis      223.0
7074           Paulo da Silva      217.0
7188       Vladimir Tkachenko      220.0
7281         Stojko Vranković      217.0
7376      Eurelijus Žukauskas      218.0
52608         Aleksey Kazakov      217.0
82100           Frédéric Weis      218.0
89070                Yao Ming      226.0
89075          Roberto Dueñas      221.0
107408       Peter John Ramos      219.0
112312           Stanko Barać      217.0
112332    Andreas Glyniadakis      216.0
112337          Hamed Haddadi      218.0
118663         Timofey Mozgov      216.0
118676        Dmitry Musersky      219.0
120266           Zhang Zhaoxu      221.0
121694            Salah Mejri      216.0
123850         Tyson Chandler      216.0
130460               Li Muhao      218.0
130461                Zhou Qi      217.0
138671          Ondřej Balvín      216.0
139365         Moustapha Fall      218.0

In [60]:
bios[bios['height_cm']>215][['name','height_cm']]

                         name  height_cm
5089       Viktor Pankrashkin      220.0
5583     Paulinho Villas Boas      217.0
5673           Gunther Behnke      221.0
5716                 Uwe Blab      218.0
5781           Tommy Burleson      223.0
5796            Andy Campbell      218.0
6223              Lars Hansen      216.0
6270              Hu Zhangbao      216.0
6409         Sergey Kovalenko      216.0
6420            Jānis Krūmiņš      218.0
6504              Luc Longley      220.0
6722         Shaquille O'Neal      216.0
6937           David Robinson      216.0
6978          Arvydas Sabonis      223.0
7074           Paulo da Silva      217.0
7188       Vladimir Tkachenko      220.0
7281         Stojko Vranković      217.0
7376      Eurelijus Žukauskas      218.0
52608         Aleksey Kazakov      217.0
82100           Frédéric Weis      218.0
89070                Yao Ming      226.0
89075          Roberto Dueñas      221.0
107408       Peter John Ramos      219.0
112312           Stanko Barać      217.0
112332    Andreas Glyniadakis      216.0
112337          Hamed Haddadi      218.0
118663         Timofey Mozgov      216.0
118676        Dmitry Musersky      219.0
120266           Zhang Zhaoxu      221.0
121694            Salah Mejri      216.0
123850         Tyson Chandler      216.0
130460               Li Muhao      218.0
130461                Zhou Qi      217.0
138671          Ondřej Balvín      216.0
139365         Moustapha Fall      218.0

In [61]:
bios.loc[1:5,['name','born_date']]

                name   born_date
1     Arnaud Boetsch  1969-04-01
2       Jean Borotra  1898-08-13
3    Jacques Brugnon  1895-05-11
4       Albert Canet  1878-04-17
5  Nicolas Chatelain  1970-01-13

In [62]:
bios[['name','born_date']]

                         name   born_date
0       Jean-François Blanchy  1886-12-12
1              Arnaud Boetsch  1969-04-01
2                Jean Borotra  1898-08-13
3             Jacques Brugnon  1895-05-11
4                Albert Canet  1878-04-17
...                       ...         ...
145495      Polina Luchnikova  2002-01-30
145496    Valeriya Merkusheva  1999-09-20
145497        Yuliya Smirnova  1998-05-08
145498         André Foussard  1899-05-19
145499          Bill Phillips  1913-07-15

[145500 rows x 2 columns]

In [63]:
bios[(bios['height_cm']>215) & (bios['born_country']=='USA')]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
5781,5804,Tommy Burleson,1952-02-24,Crossnore,North Carolina,USA,United States,223.0,102.0,NaN
6722,6755,Shaquille O'Neal,1972-03-06,Newark,New Jersey,USA,United States,216.0,137.0,NaN
6937,6972,David Robinson,1965-08-06,Key West,Florida,USA,United States,216.0,107.0,NaN
123850,126093,Tyson Chandler,1982-10-02,Hanford,California,USA,United States,216.0,107.0,NaN

In [64]:
# filtering by string conditions

In [65]:
bios[(bios['name'].str.contains("Keith",case=False))]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
1897,1907,Keith Hanlon,1966-09-01,NaN,NaN,NaN,Ireland,NaN,NaN,NaN
3505,3517,Keith Wallace,1961-03-29,Preston,England,GBR,Great Britain,165.0,51.0,1999-12-31
6228,6255,Keith Hartley,1940-10-15,Vancouver,British Columbia,CAN,Canada,200.0,85.0,NaN
8898,8946,Keith Mwila,1966-01-01,NaN,NaN,NaN,Zambia,NaN,NaN,1993-01-09
12053,12118,Keith Hervey,1898-11-03,Fulham,England,GBR,Great Britain,NaN,NaN,1973-02-22
...,...,...,...,...,...,...,...,...,...,...
109900,111105,Keith Cumberpatch,1927-08-25,Christchurch,Canterbury,NZL,New Zealand,NaN,NaN,2013-11-15
115973,117348,Keith Sanderson,1975-02-02,Plymouth,Massachusetts,USA,United States,183.0,95.0,NaN
117676,119195,Duncan Keith,1983-07-16,Winnipeg,Manitoba,CAN,Canada,185.0,88.0,NaN
122121,124176,Keith Ferguson,1979-09-07,Sale,Victoria,AUS,Australia,176.0,78.0,NaN
127310,129749,Tracy Keith-Matchitt,1990-03-30,Palmerston North,Manawatu-Wanganui,NZL,Cook Islands,167.0,60.0,NaN

In [66]:
bios[bios['name'].str.contains('Adit',case=False)]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
56416,56818,Prasert Sumpradit,1962-11-22,NaN,NaN,NaN,Thailand,173.0,75.0,NaN
73486,74052,John Oladipo Oladitan,1930-11-28,Ibadan,Oyo,NGR,Nigeria,180.0,76.0,2002-06-17
79537,80149,Dimitrios Piaditis,NaN,NaN,NaN,NaN,Greece,NaN,NaN,NaN
101090,101958,Ioannis Leivaditis,1974-01-29,Chicago,Illinois,USA,Greece,NaN,NaN,NaN
112947,114234,Tassadit Aïssou,1989-06-19,Sidi-Aïch,Béjaïa,ALG,Algeria,184.0,80.0,NaN
128047,130551,Aditi Ashok,1998-03-29,Bengaluru (Bangalore),Karnataka,IND,India,173.0,57.0,NaN
133133,136058,Sarat Sumpradit,1994-04-17,Nakhon Sawan,Nakhon Sawan,THA,Thailand,181.0,94.0,NaN
135977,139195,Kaditane Gomis,2002-08-04,NaN,NaN,NaN,France,NaN,NaN,NaN

In [67]:
bios[bios['name'].str.contains('adi|keith',case=False)]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
210,211,Ilona Váradi,1891-08-04,Budapest,Budapest,HUN,Hungary,NaN,NaN,1945-02-19
260,261,Suharyadi,1965-02-14,Blora,Jawa Tengah,INA,Indonesia,170.0,60.0,NaN
281,282,S. M. Hadi,1899-08-12,Hyderabad,Andhra Pradesh,IND,India,NaN,NaN,1971-07-14
368,369,Sylvain Cadieux,1974-09-25,Saint-Louis-de-Terrebonne,Québec,CAN,Canada,182.0,77.0,NaN
604,606,Nadia Bisiach,1965-01-25,NaN,NaN,NaN,Australia,163.0,60.0,NaN
...,...,...,...,...,...,...,...,...,...,...
144863,148568,Vladislav Kireyev,2000-09-24,NaN,NaN,NaN,Kazakhstan,NaN,NaN,NaN
144877,148582,Adil Galiakhmetov,1998-11-16,Oral,Batys Qazaqstan,KAZ,Kazakhstan,NaN,NaN,NaN
145463,149190,Vladimir Tkachyov,1993-10-05,Dnipro,Dnipropetrovsk,UKR,ROC,183.0,84.0,NaN
145474,149201,Nadine Hofstetter,1994-10-21,Romoos,Luzern,SUI,Switzerland,164.0,68.0,NaN
145481,149208,Vladislav Zharovtsev,1996-05-01,Minusinsk,Krasnoyarsk Kray,RUS,ROC,NaN,NaN,NaN

In [68]:
bios[bios['name'].str.contains('adi|keith',case=False,regex=False)]

Empty DataFrame
Columns: [athlete_id, name, born_date, born_city, born_region, born_country, NOC, height_cm, weight_kg, died_date]
Index: []

In [69]:
bios[(bios['born_country'].isin(['USA','FRA','GBR']))&(bios['name'].str.contains('Adi',case=False))]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
9535,9589,Franck Adisson,1969-07-24,Tarbes,Hautes-Pyrénées,FRA,France,180.0,70.0,NaN
13204,13284,René Abadie,1935-08-13,Labroquère,Haute-Garonne,FRA,France,NaN,NaN,1996-07-11
15318,15423,Marc Madiot,1959-04-16,Renazé,Mayenne,FRA,France,179.0,74.0,NaN
17743,17864,Vladimir Aïtoff,1879-08-05,Paris VIe,Paris,FRA,France,NaN,NaN,1963-09-06
20696,20843,Nadia Boudesoque,1918-04-11,Montcornet,Aisne,FRA,Mexico,NaN,NaN,2014-01-17
24881,25070,Sadi Dastarac,1888-06-14,Saint-Vincent-de-Paul,Landes,FRA,France,NaN,NaN,1911-02-02
28189,28399,Nadia Mimoun,1978-12-28,Montpellier,Hérault,FRA,France,160.0,44.0,NaN
29643,29868,Raymond Badin,1928-03-19,Mâcon,Saône-et-Loire,FRA,France,164.0,NaN,2000-03-01
36752,37046,Bernard Meynadier,1938-04-19,Saint-Germain-en-Laye,Yvelines,FRA,France,186.0,83.0,NaN
41762,42082,Franck Badiou,1967-03-24,Vitry-sur-Seine,Val-de-Marne,FRA,France,174.0,68.0,NaN
46364,46711,Nadine Delache,1941-02-07,Rouvray,Pas-de-Calais,FRA,France,162.0,52.0,NaN
46523,46871,Vladimir Latocha,1973-08-15,Paris,Paris,FRA,France,195.0,99.0,NaN
50746,51105,Helene Madison,1913-06-19,Madison,Wisconsin,USA,United States,NaN,NaN,1970-11-25
55247,55642,Ernest Cadine,1893-07-12,Saint-Denis,Seine-Saint-Denis,FRA,France,167.0,82.0,1978-05-20
67385,67896,Nadine Auzeil-Schoellkopf,1964-08-19,Barr,Bas-Rhin,FRA,France,176.0,60.0,NaN
67398,67909,Christiane Cadic,1947-01-08,Le Trait,Seine-Maritime,FRA,France,164.0,60.0,NaN
67414,67925,Nadine Debois,1961-09-25,Paris,Paris,FRA,France,173.0,63.0,NaN
67489,68000,Nadine Prévost,1951-05-07,Sézanne,Marne,FRA,France,167.0,60.0,NaN
67490,68001,Marguerite Radideau,1907-03-05,Paris VIe,Paris,FRA,France,NaN,NaN,1978-03-14
67559,68070,Nadia Prasad,1967-10-06,Caussade,Tarn-et-Garonne,FRA,France,158.0,44.0,NaN
67947,68462,Vladimir Prikhodko,1944-03-01,Paris XVe,Paris,FRA,France,189.0,102.0,2011-11-27
67956,68471,Pierre Ramadier,1902-05-22,Lunel,Hérault,FRA,France,171.0,69.0,1983-06-11
78283,78874,Doug Padilla,1956-10-04,Oakland,California,USA,United States,176.0,60.0,NaN
86186,86873,Linda Ferga-Khodadin,1976-12-24,Paris,Paris,FRA,France,169.0,60.0,NaN
95434,96204,Bob Paradise,1944-04-22,Saint Paul,Minnesota,USA,United States,176.0,80.0,NaN
99392,100191,Stéphane Bernadis,1974-02-23,Boulogne-Billancourt,Hauts-de-Seine,FRA,France,180.0,80.0,NaN
101090,101958,Ioannis Leivaditis,1974-01-29,Chicago,Illinois,USA,Greece,NaN,NaN,NaN
101772,102701,Mamadi Berthe,1983-01-17,Nogent-sur-Marne,Val-de-Marne,FRA,Mali,180.0,78.0,NaN
104416,105435,Hafida Gadi-Richard,1974-07-14,Saint-Étienne,Loire,FRA,France,164.0,47.0,NaN
105703,106759,Rhadi Ferguson,1973-04-03,Rockville,Maryland,USA,United States,175.0,99.0,NaN
115696,117062,Mike Zadick,1976-07-12,Great Falls,Montana,USA,United States,165.0,69.0,NaN
120134,121996,Seun Adigun,1987-01-03,Algonquin,Illinois,USA,Nigeria,165.0,70.0,NaN
124240,126527,Tianna Madison-Bartoletta,1985-08-30,Elyria,Ohio,USA,United States,168.0,58.0,NaN
126336,128687,Sadie Bjornsen,1989-11-21,Omak,Washington,USA,United States,175.0,66.0,NaN
126366,128718,Madison Chock,1992-07-02,Redondo Beach,California,USA,United States,157.0,49.0,NaN
127662,130129,Kadidiatou Diani,1995-04-01,Ivry-sur-Seine,Val-de-Marne,FRA,France,168.0,64.0,NaN
129485,132103,Madison Kocian,1997-06-15,Dallas,Texas,USA,United States,157.0,46.0,NaN
129548,132167,Madison Keys,1995-02-17,Rock Island,Illinois,USA,United States,178.0,68.0,NaN
133382,136321,Madison Hughes,1992-10-26,Epsom,England,GBR,United States,173.0,80.0,NaN
135146,138289,Madison Olsen,1995-04-07,Salt Lake City,Utah,USA,United States,170.0,61.0,NaN
135159,138302,Madison Hubbell,1991-02-24,Lansing,Michigan,USA,United States,173.0,68.0,NaN
135161,138304,Bradie Tennell,1998-01-31,Winfield,Illinois,USA,United States,168.0,55.0,NaN
135600,138814,Lexie Madigan,2002-02-12,Sacramento,California,USA,United States,NaN,NaN,NaN

In [70]:
bios[(bios['name'].str.startswith('keith'))]

Empty DataFrame
Columns: [athlete_id, name, born_date, born_city, born_region, born_country, NOC, height_cm, weight_kg, died_date]
Index: []

# Query functions

In [72]:
coffee

          Day Coffee Type  Units Sold  UnitsSold
0      Monday    Espresso          25        NaN
1      Monday       Latte          15       10.0
2     Tuesday    Espresso          30       10.0
3     Tuesday       Latte          20       10.0
4   Wednesday    Espresso          35        NaN
5   Wednesday       Latte          25        NaN
6    Thursday    Espresso          40        NaN
7    Thursday       Latte          30        NaN
8      Friday    Espresso          45        NaN
9      Friday       Latte          35        NaN
10   Saturday    Espresso          45        NaN
11   Saturday       Latte          35        NaN
12     Sunday    Espresso          45        NaN
13     Sunday       Latte          35        NaN

In [77]:
coffee.sort_values(['Units Sold','Day'],ascending=[0,1])

          Day Coffee Type  Units Sold  UnitsSold
8      Friday    Espresso          45        NaN
10   Saturday    Espresso          45        NaN
12     Sunday    Espresso          45        NaN
6    Thursday    Espresso          40        NaN
9      Friday       Latte          35        NaN
11   Saturday       Latte          35        NaN
13     Sunday       Latte          35        NaN
4   Wednesday    Espresso          35        NaN
7    Thursday       Latte          30        NaN
2     Tuesday    Espresso          30       10.0
0      Monday    Espresso          25        NaN
5   Wednesday       Latte          25        NaN
3     Tuesday       Latte          20       10.0
1      Monday       Latte          15       10.0

## Query Functions

In [81]:
bios.query('born_country=="USA" and born_city=="Seattle"')

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
11030,11088,David Halpern,1955-08-18,Seattle,Washington,USA,United States,178.0,79.0,NaN
12800,12870,Todd Trewin,1958-04-20,Seattle,Washington,USA,United States,180.0,75.0,NaN
15476,15583,Scott McKinley,1968-10-15,Seattle,Washington,USA,United States,183.0,75.0,NaN
29079,29293,Joyce Tanac,1950-09-27,Seattle,Washington,USA,United States,156.0,49.0,NaN
31135,31371,Bill Kuhlemeier,1908-01-14,Seattle,Washington,USA,United States,NaN,NaN,2001-07-08
...,...,...,...,...,...,...,...,...,...,...
133392,136331,Hans Struzyna,1989-03-31,Seattle,Washington,USA,United States,188.0,91.0,NaN
135448,138662,Maude Davis Crossland,2003-03-19,Seattle,Washington,USA,Colombia,NaN,NaN,NaN
136993,140229,Jenell Berhorst,2003-12-13,Seattle,Washington,USA,United States,NaN,NaN,NaN
143507,147159,Nevin Harrison,2002-06-02,Seattle,Washington,USA,United States,175.0,73.0,NaN
145446,149169,Corinne Stoddard,2001-08-15,Seattle,Washington,USA,United States,NaN,NaN,NaN

In [82]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [83]:
bios.tail()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20

In [84]:
bios.head(3)

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17

In [87]:
coffee.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Day          14 non-null     object
 1   Coffee Type  14 non-null     object
 2   Units Sold   14 non-null     int64
 3   UnitsSold    3 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 580.0+ bytes

## Adding and Removing the elements

In [89]:
coffee['price']=4.00

In [90]:
coffee.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Day          14 non-null     object
 1   Coffee Type  14 non-null     object
 2   Units Sold   14 non-null     int64
 3   UnitsSold    3 non-null      float64
 4   price        14 non-null     float64
dtypes: float64(2), int64(1), object(2)
memory usage: 692.0+ bytes

In [91]:
coffee

          Day Coffee Type  Units Sold  UnitsSold  price
0      Monday    Espresso          25        NaN    4.0
1      Monday       Latte          15       10.0    4.0
2     Tuesday    Espresso          30       10.0    4.0
3     Tuesday       Latte          20       10.0    4.0
4   Wednesday    Espresso          35        NaN    4.0
5   Wednesday       Latte          25        NaN    4.0
6    Thursday    Espresso          40        NaN    4.0
7    Thursday       Latte          30        NaN    4.0
8      Friday    Espresso          45        NaN    4.0
9      Friday       Latte          35        NaN    4.0
10   Saturday    Espresso          45        NaN    4.0
11   Saturday       Latte          35        NaN    4.0
12     Sunday    Espresso          45        NaN    4.0
13     Sunday       Latte          35        NaN    4.0

In [93]:
coffee['newprice']=np.where(coffee['Coffee Type']=='Espresso',3.99,4.99)

In [94]:
coffee

          Day Coffee Type  Units Sold  UnitsSold  price  newprice
0      Monday    Espresso          25        NaN    4.0      3.99
1      Monday       Latte          15       10.0    4.0      4.99
2     Tuesday    Espresso          30       10.0    4.0      3.99
3     Tuesday       Latte          20       10.0    4.0      4.99
4   Wednesday    Espresso          35        NaN    4.0      3.99
5   Wednesday       Latte          25        NaN    4.0      4.99
6    Thursday    Espresso          40        NaN    4.0      3.99
7    Thursday       Latte          30        NaN    4.0      4.99
8      Friday    Espresso          45        NaN    4.0      3.99
9      Friday       Latte          35        NaN    4.0      4.99
10   Saturday    Espresso          45        NaN    4.0      3.99
11   Saturday       Latte          35        NaN    4.0      4.99
12     Sunday    Espresso          45        NaN    4.0      3.99
13     Sunday       Latte          35        NaN    4.0      4.99

In [95]:
coffee.drop(columns=['price'])

          Day Coffee Type  Units Sold  UnitsSold  newprice
0      Monday    Espresso          25        NaN      3.99
1      Monday       Latte          15       10.0      4.99
2     Tuesday    Espresso          30       10.0      3.99
3     Tuesday       Latte          20       10.0      4.99
4   Wednesday    Espresso          35        NaN      3.99
5   Wednesday       Latte          25        NaN      4.99
6    Thursday    Espresso          40        NaN      3.99
7    Thursday       Latte          30        NaN      4.99
8      Friday    Espresso          45        NaN      3.99
9      Friday       Latte          35        NaN      4.99
10   Saturday    Espresso          45        NaN      3.99
11   Saturday       Latte          35        NaN      4.99
12     Sunday    Espresso          45        NaN      3.99
13     Sunday       Latte          35        NaN      4.99

In [96]:
coffee

          Day Coffee Type  Units Sold  UnitsSold  price  newprice
0      Monday    Espresso          25        NaN    4.0      3.99
1      Monday       Latte          15       10.0    4.0      4.99
2     Tuesday    Espresso          30       10.0    4.0      3.99
3     Tuesday       Latte          20       10.0    4.0      4.99
4   Wednesday    Espresso          35        NaN    4.0      3.99
5   Wednesday       Latte          25        NaN    4.0      4.99
6    Thursday    Espresso          40        NaN    4.0      3.99
7    Thursday       Latte          30        NaN    4.0      4.99
8      Friday    Espresso          45        NaN    4.0      3.99
9      Friday       Latte          35        NaN    4.0      4.99
10   Saturday    Espresso          45        NaN    4.0      3.99
11   Saturday       Latte          35        NaN    4.0      4.99
12     Sunday    Espresso          45        NaN    4.0      3.99
13     Sunday       Latte          35        NaN    4.0      4.99

In [99]:
coffee.drop(columns=['price'],inplace=True)

In [100]:
coffee

          Day Coffee Type  Units Sold  UnitsSold  newprice
0      Monday    Espresso          25        NaN      3.99
1      Monday       Latte          15       10.0      4.99
2     Tuesday    Espresso          30       10.0      3.99
3     Tuesday       Latte          20       10.0      4.99
4   Wednesday    Espresso          35        NaN      3.99
5   Wednesday       Latte          25        NaN      4.99
6    Thursday    Espresso          40        NaN      3.99
7    Thursday       Latte          30        NaN      4.99
8      Friday    Espresso          45        NaN      3.99
9      Friday       Latte          35        NaN      4.99
10   Saturday    Espresso          45        NaN      3.99
11   Saturday       Latte          35        NaN      4.99
12     Sunday    Espresso          45        NaN      3.99
13     Sunday       Latte          35        NaN      4.99

In [101]:
coffee

          Day Coffee Type  Units Sold  UnitsSold  newprice
0      Monday    Espresso          25        NaN      3.99
1      Monday       Latte          15       10.0      4.99
2     Tuesday    Espresso          30       10.0      3.99
3     Tuesday       Latte          20       10.0      4.99
4   Wednesday    Espresso          35        NaN      3.99
5   Wednesday       Latte          25        NaN      4.99
6    Thursday    Espresso          40        NaN      3.99
7    Thursday       Latte          30        NaN      4.99
8      Friday    Espresso          45        NaN      3.99
9      Friday       Latte          35        NaN      4.99
10   Saturday    Espresso          45        NaN      3.99
11   Saturday       Latte          35        NaN      4.99
12     Sunday    Espresso          45        NaN      3.99
13     Sunday       Latte          35        NaN      4.99

In [106]:
coffee[['Day','Coffee Type','Units Sold','newprice']]

          Day Coffee Type  Units Sold  newprice
0      Monday    Espresso          25      3.99
1      Monday       Latte          15      4.99
2     Tuesday    Espresso          30      3.99
3     Tuesday       Latte          20      4.99
4   Wednesday    Espresso          35      3.99
5   Wednesday       Latte          25      4.99
6    Thursday    Espresso          40      3.99
7    Thursday       Latte          30      4.99
8      Friday    Espresso          45      3.99
9      Friday       Latte          35      4.99
10   Saturday    Espresso          45      3.99
11   Saturday       Latte          35      4.99
12     Sunday    Espresso          45      3.99
13     Sunday       Latte          35      4.99

In [109]:
coffee['revenue']=coffee['Units Sold']*coffee['newprice']

In [110]:
coffee

          Day Coffee Type  Units Sold  UnitsSold  newprice  revenue
0      Monday    Espresso          25        NaN      3.99    99.75
1      Monday       Latte          15       10.0      4.99    74.85
2     Tuesday    Espresso          30       10.0      3.99   119.70
3     Tuesday       Latte          20       10.0      4.99    99.80
4   Wednesday    Espresso          35        NaN      3.99   139.65
5   Wednesday       Latte          25        NaN      4.99   124.75
6    Thursday    Espresso          40        NaN      3.99   159.60
7    Thursday       Latte          30        NaN      4.99   149.70
8      Friday    Espresso          45        NaN      3.99   179.55
9      Friday       Latte          35        NaN      4.99   174.65
10   Saturday    Espresso          45        NaN      3.99   179.55
11   Saturday       Latte          35        NaN      4.99   174.65
12     Sunday    Espresso          45        NaN      3.99   179.55
13     Sunday       Latte          35        NaN      4.99   174.65

In [112]:
coffee.rename(columns={'newprice':'price'},inplace=True)

In [113]:
coffee

          Day Coffee Type  Units Sold  UnitsSold  price  revenue
0      Monday    Espresso          25        NaN   3.99    99.75
1      Monday       Latte          15       10.0   4.99    74.85
2     Tuesday    Espresso          30       10.0   3.99   119.70
3     Tuesday       Latte          20       10.0   4.99    99.80
4   Wednesday    Espresso          35        NaN   3.99   139.65
5   Wednesday       Latte          25        NaN   4.99   124.75
6    Thursday    Espresso          40        NaN   3.99   159.60
7    Thursday       Latte          30        NaN   4.99   149.70
8      Friday    Espresso          45        NaN   3.99   179.55
9      Friday       Latte          35        NaN   4.99   174.65
10   Saturday    Espresso          45        NaN   3.99   179.55
11   Saturday       Latte          35        NaN   4.99   174.65
12     Sunday    Espresso          45        NaN   3.99   179.55
13     Sunday       Latte          35        NaN   4.99   174.65

In [114]:
bios

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25
...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20

In [115]:
bios['name']

0         Jean-François Blanchy
1                Arnaud Boetsch
2                  Jean Borotra
3               Jacques Brugnon
4                  Albert Canet
                  ...
145495        Polina Luchnikova
145496      Valeriya Merkusheva
145497          Yuliya Smirnova
145498           André Foussard
145499            Bill Phillips
Name: name, Length: 145500, dtype: object

In [117]:
bios['name']=bios['name'].str.split(" ").str[0]

In [118]:
bios['name']

0         Jean-François
1                Arnaud
2                  Jean
3               Jacques
4                Albert
              ...
145495           Polina
145496         Valeriya
145497           Yuliya
145498            André
145499             Bill
Name: name, Length: 145500, dtype: object

In [126]:
name=bios.query('name=="Keith"))

SyntaxError: unterminated string literal (detected at line 1) (458123420.py, line 1)

In [123]:
name

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
1897,1907,Keith,1966-09-01,NaN,NaN,NaN,Ireland,NaN,NaN,NaN
3505,3517,Keith,1961-03-29,Preston,England,GBR,Great Britain,165.0,51.0,1999-12-31
6228,6255,Keith,1940-10-15,Vancouver,British Columbia,CAN,Canada,200.0,85.0,NaN
8898,8946,Keith,1966-01-01,NaN,NaN,NaN,Zambia,NaN,NaN,1993-01-09
12053,12118,Keith,1898-11-03,Fulham,England,GBR,Great Britain,NaN,NaN,1973-02-22
...,...,...,...,...,...,...,...,...,...,...
99921,100722,Keith,1970-02-03,Providence,Rhode Island,USA,United States,188.0,93.0,NaN
102227,103168,Keith,1983-02-09,London,Ontario,CAN,Canada,185.0,75.0,NaN
109900,111105,Keith,1927-08-25,Christchurch,Canterbury,NZL,New Zealand,NaN,NaN,2013-11-15
115973,117348,Keith,1975-02-02,Plymouth,Massachusetts,USA,United States,183.0,95.0,NaN
122121,124176,Keith,1979-09-07,Sale,Victoria,AUS,Australia,176.0,78.0,NaN